const PrivacyPage = () => {
  return (
    <div>
      <h1>Политика в отношении обработки персональных данных</h1>
      <h2>1. Общие положения</h2>
      <p>
        Настоящая политика обработки персональных данных составлена в
        соответствии с требованиями Федерального закона от 27.07.2006. № 152-ФЗ
        «О персональных данных» (далее — Закон о персональных данных) и
        определяет порядок обработки персональных данных и меры по обеспечению
        безопасности персональных данных, предпринимаемые ИП Уполовневым Андреем
        Степановичем (далее — Оператор).
      </p>
      <p>
        1.2. Настоящая Политика действует в отношении всей информации, которую
        Оператор может получить о Пользователе во время использования сервисов,
        сайтов и приложений Оператора (далее — Сервисы).
      </p>
      <p>
        1.3. Целью настоящей Политики является обеспечение надлежащей защиты
        персональной информации, которую Пользователь предоставляет о себе
        самостоятельно при использовании Сервисов.
      </p>
      <p>
        1.4. Использование Сервисов означает безоговорочное согласие
        Пользователя с настоящей Политикой и указанными в ней условиями
        обработки его персональной информации.
      </p>
      <p>
        1.5. В случае несогласия с условиями Политики Пользователь должен
        прекратить использование Сервисов.
      </p>
      <p>
        1.6. Оператор не проверяет достоверность персональной информации,
        предоставляемой Пользователем, и не имеет возможности оценивать его
        дееспособность.
      </p>
      <p>
        1.7. Настоящая Политика не распространяется на действия и
        интернет-ресурсы третьих лиц, которые могут быть доступны Пользователю
        через Сервисы.
      </p>

      <h2>2. Основные понятия, используемые в Политике</h2>
      <p>
        2.1. Автоматизированная обработка персональных данных — обработка
        персональных данных с помощью средств вычислительной техники.
      </p>
      <p>
        2.2. Блокирование персональных данных — временное прекращение обработки
        персональных данных (за исключением случаев, если обработка необходима
        для уточнения персональных данных).
      </p>
      <p>
        2.3. Веб-сайт — совокупность графических и информационных материалов, а
        также программ для ЭВМ и баз данных, обеспечивающих их доступность в
        сети интернет по сетевому адресу https://balans-design-2025.vercel.app/.
      </p>
      <p>
        2.4. Информационная система персональных данных — совокупность
        содержащихся в базах данных персональных данных и обеспечивающих их
        обработку информационных технологий и технических средств.{" "}
      </p>
      <p>
        2.5. Обезличивание персональных данных — действия, в результате которых
        невозможно определить без использования дополнительной информации
        принадлежность персональных данных конкретному Пользователю или иному
        субъекту персональных данных.{" "}
      </p>
      <p>
        2.6. Обработка персональных данных — любое действие (операция) или
        совокупность действий (операций), совершаемых с использованием средств
        автоматизации или без использования таких средств с персональными
        данными, включая сбор, запись, систематизацию, накопление, хранение,
        уточнение (обновление, изменение), извлечение, использование, передачу
        (распространение, предоставление, доступ), обезличивание, блокирование,
        удаление, уничтожение персональных данных.{" "}
      </p>
      <p>
        2.7. Оператор — государственный орган, муниципальный орган, юридическое
        или физическое лицо, самостоятельно или совместно с другими лицами
        организующие и/или осуществляющие обработку персональных данных, а также
        определяющие цели обработки персональных данных, состав персональных
        данных, подлежащих обработке, действия (операции), совершаемые с
        персональными данными.{" "}
      </p>
      <p>
        2.8. Персональные данные — любая информация, относящаяся прямо или
        косвенно к определенному или определяемому Пользователю веб-сайта
        https://balans-design-2025.vercel.app/.{" "}
      </p>
      <p>
        2.9. Персональные данные, разрешенные субъектом персональных данных для
        распространения, — персональные данные, доступ неограниченного круга лиц
        к которым предоставлен субъектом персональных данных путем дачи согласия
        на обработку персональных данных, разрешенных субъектом персональных
        данных для распространения в порядке, предусмотренном Законом о
        персональных данных (далее — персональные данные, разрешенные для
        распространения).{" "}
      </p>
      <p>
        2.10. Пользователь — любой посетитель веб-сайта
        https://balans-design-2025.vercel.app/.{" "}
      </p>
      <p>
        2.11. Предоставление персональных данных — действия, направленные на
        раскрытие персональных данных определенному лицу или определенному кругу
        лиц.{" "}
      </p>
      <p>
        2.12. Распространение персональных данных — любые действия, направленные
        на раскрытие персональных данных неопределенному кругу лиц (передача
        персональных данных) или на ознакомление с персональными данными
        неограниченного круга лиц, в том числе обнародование персональных данных
        в средствах массовой информации, размещение в
        информационно-телекоммуникационных сетях или предоставление доступа к
        персональным данным каким-либо иным способом.{" "}
      </p>
      <p>
        2.13. Трансграничная передача персональных данных — передача
        персональных данных на территорию иностранного государства органу власти
        иностранного государства, иностранному физическому или иностранному
        юридическому лицу.{" "}
      </p>
      <p>
        2.14. Уничтожение персональных данных — любые действия, в результате
        которых персональные данные уничтожаются безвозвратно с невозможностью
        дальнейшего восстановления содержания персональных данных в
        информационной системе персональных данных и/или уничтожаются
        материальные носители персональных данных.
      </p>

      <h2>3. Основные права и обязанности Оператора</h2>
      <ul>
        <li>
          3.1. Оператор имеет право: — получать от субъекта персональных данных
          достоверные информацию и/или документы, содержащие персональные
          данные; — в случае отзыва субъектом персональных данных согласия на
          обработку персональных данных, а также, направления обращения с
          требованием о прекращении обработки персональных данных, Оператор
          вправе продолжить обработку персональных данных без согласия субъекта
          персональных данных при наличии оснований, указанных в Законе о
          персональных данных; — самостоятельно определять состав и перечень
          мер, необходимых и достаточных для обеспечения выполнения
          обязанностей, предусмотренных Законом о персональных данных и
          принятыми в соответствии с ним нормативными правовыми актами, если
          иное не предусмотрено Законом о персональных данных или другими
          федеральными законами.
        </li>
        <li>
          3.2. Оператор обязан: — предоставлять субъекту персональных данных по
          его просьбе информацию, касающуюся обработки его персональных данных;
          — организовывать обработку персональных данных в порядке,
          установленном действующим законодательством РФ; — отвечать на
          обращения и запросы субъектов персональных данных и их законных
          представителей в соответствии с требованиями Закона о персональных
          данных; — сообщать в уполномоченный орган по защите прав субъектов
          персональных данных по запросу этого органа необходимую информацию в
          течение 10 дней с даты получения такого запроса; — публиковать или
          иным образом обеспечивать неограниченный доступ к настоящей Политике в
          отношении обработки персональных данных; — принимать правовые,
          организационные и технические меры для защиты персональных данных от
          неправомерного или случайного доступа к ним, уничтожения, изменения,
          блокирования, копирования, предоставления, распространения
          персональных данных, а также от иных неправомерных действий в
          отношении персональных данных; — прекратить передачу (распространение,
          предоставление, доступ) персональных данных, прекратить обработку и
          уничтожить персональные данные в порядке и случаях, предусмотренных
          Законом о персональных данных; — исполнять иные обязанности,
          предусмотренные Законом о персональных данных.
        </li>
      </ul>

      <h2>4. Основные права и обязанности субъектов персональных данных</h2>

      <ul>
        <li>
          4.1. Субъекты персональных данных имеют право: — получать информацию,
          касающуюся обработки его персональных данных, за исключением случаев,
          предусмотренных федеральными законами. Сведения предоставляются
          субъекту персональных данных Оператором в доступной форме, и в них не
          должны содержаться персональные данные, относящиеся к другим субъектам
          персональных данных, за исключением случаев, когда имеются законные
          основания для раскрытия таких персональных данных. Перечень информации
          и порядок ее получения установлен Законом о персональных данных; —
          требовать от оператора уточнения его персональных данных, их
          блокирования или уничтожения в случае, если персональные данные
          являются неполными, устаревшими, неточными, незаконно полученными или
          не являются необходимыми для заявленной цели обработки, а также
          принимать предусмотренные законом меры по защите своих прав; —
          выдвигать условие предварительного согласия при обработке персональных
          данных в целях продвижения на рынке товаров, работ и услуг; — на отзыв
          согласия на обработку персональных данных, а также, на направление
          требования о прекращении обработки персональных данных; — обжаловать в
          уполномоченный орган по защите прав субъектов персональных данных или
          в судебном порядке неправомерные действия или бездействие Оператора
          при обработке его персональных данных; — на осуществление иных прав,
          предусмотренных законодательством РФ.
        </li>
        <li>
          4.2. Субъекты персональных данных обязаны: — предоставлять Оператору
          достоверные данные о себе; — сообщать Оператору об уточнении
          (обновлении, изменении) своих персональных данных.
        </li>
        <li>
          4.3. Лица, передавшие Оператору недостоверные сведения о себе, либо
          сведения о другом субъекте персональных данных без согласия
          последнего, несут ответственность в соответствии с законодательством
          РФ.
        </li>
      </ul>
    </div>
  );
}

export default PrivacyPage